#+TITLE: Funciones Básicas de C
*** Ejemplos
    #+BEGIN_SRC C :results output :var tmp=input_file :cmdline < /tmp/in.txt
      #include <stdio.h>
      #include <stdlib.h>

      #define MAX 15

      int main(){
        // De esta manera reservabamos memoria de forma estática
        //char buffer[MAX];

        // De esta otra forma reservamos memoria de forma dinámica
        char *buffer;
        // le asignamos espacio en memoria para 30 caracteres
        buffer = malloc(sizeof(char) * 30);

        printf("Ingrese una cadena de caracteres: ");
        gets(buffer);
        printf("\nTexto ingresado: %s\n", buffer);

        free(buffer);

        return 0;
      }
    #+END_SRC

    #+RESULTS:
    : Ingrese una cadena de caracteres: 
    : Texto ingresado: 10 12 15 20
*** Ejemplos
    #+BEGIN_SRC C :results output
      #include <stdio.h>
      #include <stdlib.h>

      int main(){
        // declaramos un puntero a una cadena de caracteres
        char* nombre;
        // le asignamos espacio en memoria para 30 caracteres
        // que son 30 Bytes aprox.
        nombre = malloc(sizeof(char) * 30);
        strcpy(nombre, "Carlos");
        puts(nombre);

        strcpy(nombre, "Pedro");
        puts(nombre);

        strcpy(nombre, "Pepito");
        puts(nombre);

        int valor = puts(nombre);
        printf("El valor de retorno de puts() es: %d\n", valor);

        free(nombre);
        return 0;
      }
    #+END_SRC

    #+RESULTS:
    : Carlos
    : Pedro
    : Pepito
    : Pepito
    : El valor de retorno de puts() es: 7

*** Ejemplos
    #+BEGIN_SRC C :results output :var tmp=input_file :cmdline < /tmp/in.txt
      #include <stdio.h>
      #include <stdlib.h>

      int main(){
        // declaramos una cadena de caracteres
        char *buffer;
        // le asignamos memoria para 30 caracteres
        buffer = malloc(sizeof(char)*30);

        // copiamos solo 5 caracteres de la entrada estandar (stdin)
        // hacia la cadena de caracteres buffer
        fgets(buffer, 10, stdin);
        //printf("la cadena escrita fue: %s\n", buffer);
        printf("la cadena escita fue: %s\n", buffer);

        printf("el 1er caracter es: %c\n", *buffer);
        printf("el 2do caracter es: %c\n", *(buffer+1));
        printf("el 4to caracter es: %c\n", *(buffer+3));

        free(buffer);

        return 0;
      }
    #+END_SRC

    #+RESULTS:
    : la cadena escita fue: 10 12 15 
    : el 1er caracter es: 1
    : el 2do caracter es: 0
    : el 4to caracter es: 1
*** Ejemplos
    #+BEGIN_SRC C :results output
      #include <stdio.h>
      #include <stdlib.h>
      #include <string.h>

      int main(){
        char apellido[20] = "fernandez"; // se asigna un espacio en memoria fijo
        char* nombreApellido;

        // esto es lo mismo que hacer
        // char nombre[20] = "carlos"
        // con la diferencia que la longitud la puedo definir luego de su declaración
        const char* nombre;
        nombre = malloc(sizeof(char)*20);
        strcpy(nombre, "carlos");

        nombreApellido = malloc(sizeof(char)*60);

        strcat(nombreApellido, nombre);
        puts(nombreApellido);

        strcat(nombreApellido, apellido);
        puts(nombreApellido);

        free(nombre);
        free(nombreApellido);

        return 0;
      }
    #+END_SRC

    #+RESULTS:
    : carlos
    : carlosfernandez
